const allQuestions = [
    [ // 1. МЕХАНИКА
        {q:"Физика эмнени окутат?", a:["Жаратылышты", "Сандарды"], c:"Жаратылышты"},
        {q:"Ылдамдыктын бирдиги?", a:["м/с", "кг"], c:"м/с"}
    ],
    [ // 2. МОЛЕКУЛАЛЫК ФИЗИКА
        {q:"Заттын эң кичине бөлүкчөсү?", a:["Молекула", "Клетка"], c:"Молекула"}
    ],
    [ // 3. ЭЛЕКТРОДИНАМИКА
        {q:"Токтун күчү эмне менен өлчөнөт?", a:["Амперметр", "Вольтметр"], c:"Амперметр"}
    ],
    [ // 4. ТЕРМЕЛҮҮЛӨР ЖАНА ТОЛКУНДАР
        {q:"Термелүү периодунун бирдиги?", a:["Секунда", "Метр"], c:"Секунда"}
    ],
    [ // 5. ОПТИКА
        {q:"Жарык ылдамдыгы канча?", a:["300 000 км/с", "1000 км/с"], c:"300 000 км/с"}
    ],
    [ // 6. АТОМДУК ЖАНА ЯДРОЛУК ФИЗИКА
        {q:"Атомдун ядросунда эмне бар?", a:["Протон жана нейтрон", "Электрон"], c:"Протон жана нейтрон"}
    ],
    [ // 7. АСТРОНОМИЯ
        {q:"Күн системасындагы эң чоң планета?", a:["Юпитер", "Марс"], c:"Юпитер"}
    ]
];
